// --------------------------------------------------------
var router = require('express').Router();
// --------------------------------------------------------

//==== 테스팅 용도 =============================
router.get('/', function (req, res, next) {
    res.send("환영합니다");
});
// --------------------------------------------------------
module.exports = router;





// 200: 요청이 성공적
// 201: 성공적으로 생성되었음
// 400: 잘못된 문법
// 401: 비인증 // jwt 잘못되어도 뜸
// 403: 권한부족
// 404: NOT FOUND
// 409: 리소스와 타켓리소스가 충돌
// 500: 서버에러